content-org/tech.org
   #+hugo_base_dir: d:/Hugo/myblog/
   #+hugo_section: post  
   #+hugo_auto_set_lastmod: t
   #+hugo_code_fence: nil  
   #+hugo_front_matter_key_replace: description>summary
   #+hugo_custom_front_matter: image img/111.jpg
   
** DONE The Little Schemer speedy referring note (2/3)                :@TECH:
   CLOSED: [2019-12-23 Mon 01:35]
   :PROPERTIES:
   :EXPORT_FILE_NAME: The-little-schemer-note-2-3
   :END:
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2019-12-23 Mon 01:35]
   :END:

This is a quick reference note that I pull from the book The Little Schemer. The
full detailed code can be found:

[[https://github.com/pkrumins/the-little-schemer/blob/master/02-do-it-again.ss][the-little-schemer/02-do-it-again.ss at master · pkrumins/the-little-schemer]]


*** Chapter 7 Friend and Relations
-----

In this chapter, we see more examples of using the previously defined functions
to develop more functions.

*set* is a list consists of *non-repeated* atoms. The function =(set? argument)=
 checks whether a list is a set. It can be written with =(member?)=:
#+begin_src scheme
  (define member?
    (lambda (a lat)
      (cond
        ((null? lat) #f)
        (else (or (eq? (car lat) a)
                  (member? a (cdr lat)))))))

;(set? '(apple 3 pear 4 9 apple 3 4)) -> #f
  (define set?
    (lambda (lat)
      (cond
        ((null? lat) #t)
        ((member? (car lat) (cdr lat)) #f)
        (else
          (set? (cdr lat))))))
#+end_src

=(makeset argument)= make a new list by removing duplicated atoms in argument
list. For a repeated atom in list, in order to retain the first occurrence while remove others, we use =(multirember)=: 
 #+begin_src scheme
(define multirember
  (lambda (a lat)
    (cond
      ((null? lat) '())
      ((eq? (car lat) a)
       (multirember a (cdr lat)))
      (else
        (cons (car lat) (multirember a (cdr lat)))))))

;(makeset '(apple 3 pear 4 9 apple 3 4))
(define makeset
  (lambda (lat)
    (cond
      ((null? lat) '())
      (else
        (cons (car lat)
              (makeset (multirember (car lat) (cdr lat))))))))
 #+end_src

For sets, we can define some primary functions: =(subset? argument1 argument2)=
checks whether argument1 is a subset of argument2. =(eqset?= and =(intersect?)= check for
equality and intersection respectively. Comparing the three algorithms, we can
find how the different mathmatical functions can be achieved by manipulating the logical tools. 
#+begin_src scheme
; (subset? '(4 pounds of horseradish)
; '(four pounds of chicken and 5 ounces of horseradish)) -> #f
(define subset?
    (lambda (set1 set2)
      (cond
        ((null? set1) #t)
        (else (and (member? (car set1) set2)
                   (subset? (cdr set1) set2))))))

;(eqset? '(a b c) '(a b)) -> #f
  (define eqset?
    (lambda (set1 set2)
      (and (subset? set1 set2)
           (subset? set2 set1))))

;(intersect? '(stewed tomatoes and macaroni) '(macaroni and cheese)) -> #t
  (define intersect?
    (lambda (set1 set2)
      (cond
        ((null? set1) #f)
        (else (or (member? (car set1) set2)
                  (intersect? (cdr set1) set2))))))
#+end_src

The below functions do a bit more, they return intersection or union or difference results as
 *set* out of the arguments sets.
#+begin_src scheme
;(intersect '(stewed tomatoes and macaroni) '(macaroni and cheese)) -> '(and macaroni)
(define intersect
  (lambda (set1 set2)
      (cond
        ((null? set1) '())
        ((member? (car set1) set2)
         (cons (car set1) (intersect (cdr set1) set2)))
        (else
          (intersect (cdr set1) set2)))))

;(union '(stewed tomatoes and macaroni casserole) '(macaroni and cheese))
; -> '(stewed tomatoes casserole macaroni and cheese)
(define union
   (lambda (set1 set2)
      (cond
        ((null? set1) set2)
        ((member? (car set1) set2)
         (union (cdr set1) set2))
        (else (cons (car set1) (union (cdr set1) set2))))))

;(xxx '(a b c) '(a b d e f)) -> '(c)
(define xxx
  (lambda (set1 set2)
    (cond
      ((null? set1) '())
      ((member? (car set1) set2)
       (xxx (cdr set1) set2))
      (else
        (cons (car set1) (xxx (cdr set1) set2))))))

;(intersectall '((a b c) (c a d e) (e f g h a b))) -> '(a)
(define intersectall
  (lambda (l-set)
    (cond
      ((null? (cdr l-set)) (car l-set))
      (else
        (intersect (car l-set) (intersectall (cdr l-set)))))))
#+end_src

The *pair* is a list with only TWO s-expressions and the *rel* is a set of
pairs. We use =(set?)= and =(firsts)= to define =(fun?)=, which is used to test
whether =(firsts argument)= is a set.(i.e. whether a list consisting of all first
element of first-level sub-expressions contains duplicated atom). 
#+begin_src scheme
(define set?
      (lambda (lat)
        (cond
          ((null? lat) #t)
          ((member? (car lat) (cdr lat)) #f)
          (else
            (set? (cdr lat)))))

(define firsts
  (lambda (l)
    (cond
      ((null? l) '())
      (else
        (cons (car (car l)) (firsts (cdr l))))))

;(fun? '((4 3) (4 2) (7 6) (6 2) (3 4))) -> #f
;(fun? '((8 3) (4 2) (7 6) (6 2) (3 4))) -> #t
(define fun?
  (lambda (rel)
    (set? (firsts rel))))
#+end_src

A list of pairs in which no *first* element of any pair is the same as any other
*first* element, is call a *finite function*; a list of pairs in which no *second*
element of any pair is the same as any other *second* element, is call a
*fullfun*. 

Think about how these two conceptions are connected. For example, we introduce
=(revrel)= to switch each atoms for every pair within a list.
#+begin_src scheme
;(revrel '((8 a) (pumpkin pie) (got sick))) -> '((a 8) (pie pumpkin) (sick got))
(define revrel
  (lambda (rel)
    (cond
      ((null? rel) '())
      (else (cons (build (second (car rel))
                         (first (car rel)))
                  (revrel (cdr rel)))))))

;introducing revpair to simplify revrel
(define revpair
  (lambda (p)
    (build (second p) (first p))))

(define revrel
  (lambda (rel)
    (cond
      ((null? rel) '())
      (else (cons (revpair (car rel)) (revrel (cdr rel)))))))
#+end_src

Naturally, we could define =(seconds)= as we define =(firsts)= to develop
=(fullfun?)= for detecting duplicated second atom.
#+begin_src scheme
(define seconds
  (lambda (l)
    (cond
      ((null? l) '())
      (else
        (cons (second (car l)) (seconds (cdr l)))))))

;(fullfun? '((8 3) (4 2) (7 6) (6 2) (3 4))) -> #f
;(fullfun? '((8 3) (4 8) (7 6) (6 2) (3 4))) -> #t
(define fullfun?
  (lambda (fun)
    (set? (seconds fun))))
#+end_src

But, with the help of =(revrel)=, we can define =(fullfun?)= in a better way.
Let's call it =(one-to-one?)=:
#+begin_src scheme
;(one-to-one? '((chocolate chip) (doughy cookie))) -> #t
(define one-to-one?
  (lambda (fun)
    (fun? (revrel fun))))
#+end_src

