content/post/The-little-schemer-note-2-3.md


## Chapter 8 Lambda and the Ultimate {#chapter-8-lambda-and-the-ultimate}

In the previous chapters, we've seen over and over that a function takes **list
or atom** as input and returns **list or atom** as output. In this chapter, we
will be learning how to write a function that takes input and returns
**functions**. Technically, a digit/atom is a function too, which takes itself as
argument and returns itself. Taking an naive example, the `(eq?-f)` is a
functional projection which takes `a` (a constant function) as argument and
returns `(eq?-a)` (equivelent in concept) as output. It's called currying.

{{< highlight scheme >}}
(define eq?-f)
 (lambda (a)
   (lambda (x)
    (eq? x a))))

(define eq?-a
 (lambda (x)
  (eq? x a))
{{< /highlight >}}

But the functional projection is sometimes more confusing when there are
recursions involved in multiple stages, especially we will no longer spercify
whether every input is an argument or an function. Therefore it will always be beneficial to ask yourself, which functions has been
previously defined, and how its default arguments are tweaked in developing the
current function.
Let's improve it a little with a familiar function:

{{< highlight scheme >}}
(define rember-f
  (lambda (test?)
    (lambda (a l)
      (cond
        ((null? l) '())
        ((test? (car l) a) (cdr l))
        (else
          (cons (car l) ((rember-f test?) a (cdr l))))))))

; the test? can be eq? equal? eqan? eqlist? eqpair?
; depending on which type of member you plan to remove.
;e.g. remove number: ((rember-f eq?) 2 '(1 2 3 4 5)) -> '(1 3 4 5)
{{< /highlight >}}

Notice that this is not a well defined function yet, since we have not
specify the mapping relations. But it can lead us think that `test?` is an equivalent of `a` in the first
example, i.e. a function `(test?)` works as an argument input in function
`(rember-f)`, which together returns a member-removing function as result. This
came because we can find that in `(rember)` function family, whether we want to remove atom
or number or pair or list, the only different part is the equality checking.

It's therefore natural that we want to deconstruct a compound function as
invariant functions + variant function, which allows us to extend more functions efficiently.
Because there are lots of commonly used building blocks in developing algorithms and with currying, we get to write much less repetitive code.

For example, when defining `(insertL)` and `(insertR)`, we notice that the only
difference is the order we `cons` the _new_ and _old_ argument, which can be
isolated as another two small variant functions, and then combined to a main,
invariant function:

{{< highlight scheme >}}
;variant functions
(define seqL
  (lambda (new old l)
      (cons new (cons old l))))

(define seqR
  (lambda (new old l)
      (cons old (cons new l))))

;invariant function containing seq as an abstract place holder
(define insert-g
  (lambda (seq)
      (lambda (new old l)
        (cond
          ((null? l) '())
          ((eq? (car l) old)
           (seq new old (cdr l)))
          (else
            (cons (car l) ((insert-g seq) new old (cdr l))))))))

;compound function
(define insertL (insert-g seqL))

(define insertR (insert-g seqR))
{{< /highlight >}}

The substitution function only differs in the same position, so it can be
rewritten as:

{{< highlight scheme >}}
;recap subst
(define subst
  (lambda (new old l)
    (cond
      ((null? l) '())
      ((eq? (car l) old)
       (cons new (cdr l)))
      (else
        (cons (car l) (subst new old (cdr l)))))))

;firstly we define variant function
(define seqS
  (lambda (new old l)
    (cons new l)))

;rewrite invariant function accordingly
(define subst-f
 (lambda (seq)
  (lambda (new old l)
    (cond
      ((null? l) '())
      ((eq? (car l) old)
       (seq new old cdr(l)))
      (else
        (cons (car l) (subst-f new old (cdr l)))))))

;huh! the subst-f is identical to insert-g, so we can write as:
(define subst (insert-g seqS))
{{< /highlight >}}

The `(rember)` function can be achieved by `(insert-g)` too, but it requires
extra tweak, since the `(rember)` doesn't use arguments _new_. The `(seqrem)`
function replaces the old seq's job: it neither cons on left nor right, but only
retains the third argument, aka `(cdr l)`.

{{< highlight scheme >}}
;invariant function with seqrem as place holder
(define yyy
  (lambda (a l)
    ((insert-g seqrem) #f a l)))

(define insert-g
  (lambda (seq)
      (lambda (new old l)
        (cond
          ((null? l) '())
          ((eq? (car l) old)
           (seq new old (cdr l)))
          (else
            (cons (car l) ((insert-g seq) new old (cdr l))))))))

(define seqrem
  (lambda (new old l)
    l))
;(yyy 'sausage '(pizza with sausage and bacon)) -> '(pizza with and bacon)
{{< /highlight >}}

Let's see a function with more and more isolated parts to decrease repetitive
work in writting functions. In the `(value)`, we've used 1st-sub-ex and 2nd-sub-exp to write
less _car_ and _cdr_. Here we isolate two more parts `operator` to **locate** the
calculation operator and `atom-to-function` to **match and export** the
calculation operator. Notice that genetically the arguments are named as `aexp`
and `atom` inside the functions, but when they are called in `(value-f)`, the
arguments are tweaked with the arguments of `(value-f)`.

{{< highlight scheme >}}
;value uses 1st-sub-exp
(define 1st-sub-exp
  (lambda (aexp)
    (car (cdr aexp))))

;value uses 2nd-sub-exp
(define 2nd-sub-exp
  (lambda (aexp)
    (car (cdr (cdr aexp)))))

;atom-to-function uses operator
(define operator
  (lambda (aexp)
    (car aexp)))

;half abstracted function
(define value
  (lambda (nexp)
    (cond
      ((atom? nexp) nexp)
      ((eq? (operator nexp) 'o+)
       (+ (value-prefix (1st-sub-exp nexp))
          (value (2nd-sub-exp nexp))))
      ((eq? (car nexp) 'o*)
       (* (value (1st-sub-exp nexp))
          (value (2nd-sub-exp nexp))))
      ((eq? (car nexp) 'o^)
       (expt (value (1st-sub-exp nexp))
             (value (2nd-sub-exp nexp))))
      (else #f))))

;keep abstract it with what we learned in this chapter
(define atom-to-function
  (lambda (atom)
    (cond
      ((eq? atom 'o+) +)
      ((eq? atom 'o*) *)
      ((eq? atom 'o^) expt)
      (else #f))))

;(value-f '(o+ 1 (o^ 3 4))) -> 82
(define value-f
  (lambda (nexp)
    (cond
      ((atom? nexp) nexp)
      (else
        ((atom-to-function (operator nexp))
         (value-f (1st-sub-exp nexp))
         (value-f (2nd-sub-exp nexp)))))))
{{< /highlight >}}

Here is another compound function containing more layers of abstractions, which
doesn't only call other functions, but also contains recursions on multiple conditions:

{{< highlight scheme >}}
(define multiremember&co
 (lambda (a lat col)
    (cond
      ((null? lat)
       (col '() '()))
      ((eq? (car lat) a)
       (multiremember&co a (cdr lat)
       (lambda (newlat seen)
         (col newlat (cons (car lat) seen)))))
      (else
        (multiremember&co a (cdr lat)
                          (lambda (newlat seen)
                            (col (cons (car lat) newlat) seen)))))))

(define a-friend
 (lambda (x y)
  (null? y)))
;(multiremember&co 'tuna '() a-friend) -> #t;
;(multiremember&co 'tuna '(tuna) a-friend) -> #f

;(multiremember&co 'tuna '(and tuna) a-friend) -> #f
;in the final recursion, it gets us:
;a=tuna
;lat='()
;col=
;((lambda (newlat1 seen1)
;   ((lambda (newlat2 seen2)
;      (list newlat2 (cons 'foo seen2)))
;    (cons 'bar newlat1)
;    seen1))
; '() '())

;define a different continuation
(define last-friend
 (lambda (x y)
  (length? x)))
;(multiremember&co 'tuna (strawberries tuna and swordfish) last-friend) -> 3
{{< /highlight >}}

The question has been also discussed on SO: [recursion - Explain the
continuation example on p.137 of The Little Schemer - Stack Overflow](https://stackoverflow.com/questions/7004636/explain-the-continuation-example-on-p-137-of-the-little-schemer)

{{< highlight scheme >}}
(define multiinsertLR
  (lambda (new oldL oldR lat)
    (cond
      ((null? lat) '())
      ((eq? (car lat) oldL)
       (cons new
             (cons oldL
                   (multiinsertLR new oldL oldR (cdr lat)))))
      ((eq? (car lat) oldR)
       (cons oldR
             (cons new
                   (multiinsertLR new oldL oldR (cdr lat)))))
      (else
        (cons
          (car lat)
          (multiinsertLR new oldL oldR (cdr lat)))))))

(define multiinsertLR&co
  (lambda (new oldL oldR lat col)
    (cond
      ((null? lat)
       (col '() 0 0))
      ((eq? (car lat) oldL)
       (multiinsertLR&co new oldL oldR (cdr lat)
                         (lambda (newlat L R)
                           (col (cons new (cons oldL newlat))
                                (+ 1 L) R))))
      ((eq? (car lat) oldR)
       (multiinsertLR&co new oldL oldR (cdr lat)
                         (lambda (newlat L R)
                           (col (cons oldR (cons new newlat))
                                L (+ 1 R)))))
      (else
        (multiinsertLR&co new oldL oldR (cdr lat)
                          (lambda (newlat L R)
                            (col (cons (car lat) newlat)
                                 L R)))))))
;some collectors
(define col1
  (lambda (lat L R)
    lat))
(define col2
  (lambda (lat L R)
    L))
(define col3
  (lambda (lat L R)
    R))

; Examples of multiinsertLR&co
(multiinsertLR&co 'salty 'fish 'chips '(chips and fish or fish and chips)  col1)
;-> '(chips salty and salty fish or salty fish and chips salty)
(multiinsertLR&co  'salty  'fish  'chips  '(chips and fish or fish and chips)  col2)
;-> 2
(multiinsertLR&co  'salty 'fish 'chips '(chips and fish or fish and chips) col3)
;-> 2
{{< /highlight >}}

{{< highlight scheme >}}
;(evens-only* '((9 1 2 8) 3 10 ((9 9) 7 6) 2)) -> '((2 8) 10 (() 6) 2)
(define evens-only*
  (lambda (l)
    (cond
      ((null? l) '())
      ((atom? (car l))
       (cond
         ((even? (car l))
          (cons (car l)
                (evens-only* (cdr l))))
         (else
           (evens-only* (cdr l)))))
      (else
        (cons (evens-only* (car l))
              (evens-only* (cdr l)))))))

;define *&co function
(define evens-only*&co
  (lambda (l col)
    (cond
      ((null? l)
       (col '() 1 0))
      ((atom? (car l))
       (cond
         ((even? (car l))
          (evens-only*&co (cdr l)
                          (lambda (newl p s)
                            (col (cons (car l) newl) (* (car l) p) s))))
         (else
           (evens-only*&co (cdr l)
                           (lambda (newl p s)
                             (col newl p (+ (car l) s)))))))
      (else
        (evens-only*&co (car l)
                        (lambda (al ap as)
                          (evens-only*&co (cdr l)
                                          (lambda (dl dp ds)
                                            (col (cons al dl)
                                                 (* ap dp)
                                                 (+ as ds))))))))))
(define evens-friend
  (lambda (e p s)
    e))

;(evens-only*&co '((9 1 2 8) 3 10 ((9 9) 7 6) 2) evens-friend)
; -> '((2 8) 10 (() 6) 2)
{{< /highlight >}}
